using BunkerGame.Backend.Models;

namespace BunkerGame.Backend.Services;

public class GameService
{
    private static readonly string[] Professions = 
    { 
        "Программист", "Безработный", "Вето", "Тэхо", "Аналитик ошибок валорант", "Охотник на Радианов", 
        "Джетт", "Рейна", "Астра", "Брич", "Бримстоун", "Чембер ",
        "Клов", "Сайфер", "Дедлок", "Фейд", "Гекко",
        "Харбор", "Исо", "Кайо", "Киллджой", "Микс", 
        "Неон", "Омен", "Феникс", "Рейз", "Сейдж", "Скай", "Сова",
        "Вайпер", "Вэйлэй", "Йору", "Специалист по выживанию на 1 HP", "Киберспортсмен",
        "Геймер", "Создатель валорант трекера", "Актер озвучки взрыва спайка", "Читер", "Смурф", "Контентмейкер Riot Games", "Разводила на скины (мурчит в обмен на скинчик)", "Трештолкер (агрессирует на команду)",
        "СММщик валорант", "Тиктокер по Валоранту", "Писатель фанфиков по валорант", "Косплеер Клов", "Художник порно артов по валорант", "Аниматор синематиков по валорант", "Геймер валорант на джойстике", "Птица Скай", "Геймер валорант мобайл",
        "Вингман (бегун Гекко)", "Кошка фейды", "Клон Йору", "Креативщий Риот Геймс", "Репорт-менеджер", "Мастер фейк обезвреживания спайка", "Пророк позиций противника (всегда угадывает местоположение противников)",
        "Соло-керри (может тащить игру сам)", "Мастер стрельбы из одина", "Руинер", "Вечно позитивный тимейт", "Тестировщик античита", 
        "Афк на спавне", "Коллекционер эксклюзивных скинов", "Продавец аккаунтов валорант", "Тренер киберспортсменов", "Тренер по менталке", "Психолог для аггентов", "Художник графити в валорант", 
        "Стример Валорант", "Дизайнер карт Валорант", "Комментатор турниров Чемпионс", "Тестировщик багов валорант", "Балансировщик агентов", "Владелец чата СЕСН", "Инженер систем жизнеобеспечения (проектировал похожий бункер)",
        "Механик боевых дронов", "Инженер по укреплению убежищ", "Техник по обслуживанию телепортов Чембера", "Специалист по обезвреживанию спайка", "Техник по ремонту турелей Киллджой", "Разработчик античит-систем", "Инженер по виртуальной реальности", 
        "Разработчик тактических ботов", "Сертифицированный проверяющий углы", "Профессиональный кемпер", "Логист гуманитарных поставок",
        "Сапёр", "Робототехник", "Специалист по поисково-спасательным операциям", "Профессиональный люркер", "Специалист по восстановлению данных",
        "Инженер по переработке скинов в реальные ресурсы", "Профессиональный детектор смурфов", "Хакер", "Аудитор запасов (ведёт подсчеты всех ресурсов)", 
    };
    private static readonly string[] Genders =
    {
        "Мужской", "Женский", "Трансгендер", "Небинарный (не идентифицирую себя как мужчина или женщина)",
    };
    

    private static readonly string[] Orientations =
    {
        "Гетеросексуал (натурал)", "Гомосексуал (гей/лесби)", "Бисексуал(нрав и мужчины и женщины)", "Асексуал (не испытывает сексуального влечения)", 
        "Аромантик (не испытывает романтического влечения)", "Пансексуал (влечение к людям независимо от их пола или гендера)",                                                   
    };
    
    private static readonly string[] Healthes =
    {
        "Идеальное здоровье", "Эпилепсия", "Хроническая мигрень", "Камни в почках",
        "Слепой", "Глухой", "Немой", "Отсутствует мизинец на левой ноге", "Обычная простуда", 
        "Аллергия на воду", "Ветрянка", "Вши", "Синдром чужой руки (Одна рука «живёт своей жизнью.»)",
        "Депрессия", "Бессонница", "Тревожное расстройство", "Астма", "Артрит", "Диссоциативное расстройство идентичности",
        "Туберкулёз", "ВИЧ / СПИД", "Бешенство",  "COVID-19", "Паранойя", "Шизофрения", 
        "ПТСР (Посттравматическое стрессовое расстройство)", "Диабет (1 или 2 типа)", "ОКР (возникают навязчивые мысли, вызывающие сильную тревогу,)",
        "Дальтонизм", "Гермафродит (имеются и мужские и женские половые органы)", "Метеоризм – хроническое газообразование (пуки)", 
        "Аутизм", "Лунатизм ", "Хроническая икота", "Чувствительность к глютену", "Непереносимость лактозы",
        "Кратковременная потеря памяти", "Аллергия на орехи", "Гиперсексуальность – чрезмерное половое влечение", 
        "Синдром иностранного акцента – внезапно начинает говорить со странным акцентом после травмы", 
        "Одержимость клеромантией – принимает каждое решение с помощью костей или подбрасывания монеты",
        "Аллергия на рыбу",
        "Идеальное здоровье ", 
        "Идеальное здоровье",
        "Никогда не обследовался",  
        "Аллергия на животных",  
        "Аллергия на лекарства",  "Отсутствует рука", "Кашель", "Насморк",
        
    };

    private static readonly string[] Hobbys =
    {
        "Играет в валорант на руле", "Надрачивание AimLab перед каждой игрой", "После каждой игры уходит в стрельбище",
        "Считает экономику врага в уме", "Крутит нож каждые 2 секунды", "Рисует тактические карты и изучает ориентирование",
        "Сборка LEGO без инструкций", "Изучение шрифта Брайля", "Делает эдиты в TikTok под замедленный фонк", "Взывает тимейтов",
        "Изучает лор валорант", "Просит скинуть скин каждый раунд", "Озвучивает реплики агентов в реальной жизни", 
        "Угрожать репортами за «неправильный» смок", "Мьютиь всю команду на первой секунде", "Мазохист (получение удовольствия от собственной боли)",
        "Учит польский язык ради игры на Варшаве",
        "Коллекционировать скриншоты побед со счетом 13-0", "Заучивание биографии актеров озвучки агентов", "Обучение новичков базовой тактике", "Стрельба из лука",
        "Ментальный коучинг и анти-тильт", "Тренировка реакции и фликов", "Первая помощь", "Кулинария", "Сборка и паяние кастомных девайсов",
        "Организация командных ивентов", "Проектирование систем растяжек и сигналок", "Приготовление лечебных отваров", "Паркур", 
        "Разведка «встречным пиком»", "Метание предметов на точность", "Восстановление битых накопителей и файлов", 
        "Ремонт и обслуживание оптических прицелов", "Дыхательная гимнастика от панических атак", "Чтение карт и ориентирование", "Взлом замков",
        "Самооборона / Боевые искусства", "Пивоварение", "Изучение медицинской терминологии и анатомии", "Ведение видео и аудиодневника выживания",
        "Измерение уровня радиации и токсичности датчиками", "Оригами", "Рассказывание историй", "Заточка и обслуживание режущих инструментов", 
        "Оценка качества и свежести консервированных продуктов", "Шибари (японское искусство связывания верёвкой)", 
        "Собирает устройства из старых компьютерных комплектующих", "Изготовление свечей",
        "BDSM", "Изготовление самодельных инструментов", "Проектирует ловушки как Киллджой", "Практикует стелс-прохождения игр на максимальной сложности",
        "Проходит хардкорные режимы выживания в Minecraft", "Медитация", "Готовит блюда из трёх случайных ингредиентов", "Коллекционирование насекомых", 
        "Собирает LEGO Technic без инструкций", 
        "Смотрит разборы химических и биологических угроз на YouTube", "После каждого поражения смотрит реплей и ищет ошибки", "Решение головоломок",
        "Коллекционирует скины VALORANT и знает их цены наизусть", "Собирает фигурки агентов и разговаривает с ними",
        "Охота", "Смотрит турниры VALORANT по восемь часов в день", "Коллекционирует коврики для мыши и не отдаёт их никому", "Экстренный уход за детьми", 
        "Учит азбуку Морзе ради общения без интернета", "Знает все лайнапы Сайфера на всех картах",
        "Знает наизусть все звуки перезарядки оружия VALORANT", "Создаёт моды для игр, которыми никто не пользуется", "Ролевые игры", 
        "Любит всех щекотать", "Изучение истории", 
        "Сборка радиоприёмников", "Умеет определять модель видеокарты по звуку вентиляторов",
        "Сатанизм",
      
    };

    private static readonly string[] Phobias =
    {
        "Андрофобия — страх мужчин", "Никтофобия — страх темноты", "Фобофобия - навязчивый страх испытать страх", 
        "Автомизофобия — страх испачкать своё тело", "Турофобия — страх сыра", 
        "Айхмофобия — страх острых предметов", "Клаустрофобия - боязнь замкнутых пространств", "Аквафобия - страх воды", "Нет фобии", 
        "Аутофобия— страх оставаться в одиночестве", "Блаптофобия — страх причинить кому-то вред", "Гелиофобия — страх солнца", 
        "Гравидофобия — страх беременности или родов", "Антропофобия – страх людей", 
        "Автоматонофобия – страх роботов или ИИ", 
        "Гиппопотомонстросесквипедалиофобия – страх длинных слов",  "Гемофобия – страх крови", 
        "Гинофобия – страх женщин",  "Эротофобия – страх сексуальных тем", "Партенофобия – страх девственниц ",
        "Аглиофобия – страх боли", "Эфебифобия – страх подростков", "Эметофобия – страх рвоты",
        "Мизофобия – страх микробов или грязи",
        "Бримофобия - страх ультимейта Бримстоуна",  "Урофобия – страх мочи или мочеиспускания",
        "Бананафобия – страх бананов", "Кинемортофобия – страх зомби или нежити",
        "Неонофобия – страх Неон", "Трискаидекафобия – страх числа 13",
        "Зоофобия – страх животных", "Флешкофобия – страх флешек", "Углофобия - страх углов на карте", "Вингмофобия - страх Вингмана",
        
    };

    private static readonly string[] Luggaages =
    {
        "Мачете", "Аптечка первой помощи", "Консервы, Таблетки для очистки воды", "Генератор", "Фонарик", "Дробовик", 
        "Семена для посадки овощей", "Батарейки", "Ручное радио", "Набор для розжига огня", "Комплект прочной одежды", "Обезболивающие",
        "Блендер с ручным приводом", "Блокнот и ручка", "Руководство по выживанию при зомби-апокалипсисе", "Верёвка", "Антибиотики", "Военные ботинки",
        "Запас еды на две недели", "Шлем против телепатии", "Мультитул с пассатижами, отвёртками и ножомп", "Энергетические батончики", "Радиационный костюм",
        "Устройство перевода", "Лазерная указка", "10 кг шоколада", "Вандал и 200 патронов к нему", "Термоспальный мешок",
        "Справочник по биологии пришельцев", "Плащ-невидимка", "Бинокль", "Преобразователь энергии", "Камуфляжная одежда",
        "Инфракрасные очки", "Глушитель дронов", "Руководство по медитации", "Игровой ноутбук с мощной видеокартой",
        "Дротики с транквилизатором", "Домашняя гидропонная установка", "Энциклопедия динозавров", "Верёвочная лестница", "Наушники с шумоподавлением",
        "Один и 100 патронов к пистолету", "Солнечный фонарь", "Альпинистское снаряжение", "GPS-устройство", "Снеки для выживания", "RTX 5090 без компьютера",
        "Фейерверки (для отвлечения)", "Датчик движения", "Деревянное копьё", "Компас",
        "Топографическая карта", "Контейнер для образцов", "Стальной капкан", "Водонепроницаемая сумка", "Надувной плот", "Очиститель воды",
        "Удочка", "Кастомная клавиатура за тысячу евро", "Дождевик", "Руководство по выживанию в море", "Сто случайных флешек с неизвестным содержимым", "Запечатанный набор LEGO", "Гидрокостюм",
        "Спасательный жилет", "Портативная плита", "Скотч", "Насос для опреснения (делает воду питьевой)", "Электрогитара с усилителем", "Аварийная сигнальная ракета",
        "Противомоскитная сетка", "Аварийное радио", "Механическая пишущая машинка", "Коллекция фигурок всех агентов",  "Ящик энергетиков с коллекционными банками",
        "Глушитель сигналов", "Коврик для мыши размером со всю кровать", "Камера Сайфера", "Связка ключей, но непонятно от чего они", "Вентилятор на батарейках",
        "Музыкальные компакт-диски", "Бумажные карты", "Справочник по шифрованию", "Руководство по азбуке Морзе", "Механические часы", "Набор для маскировки", 
        "Пять килограммов термопасты", "Головоломки", "Коллекция настольных игр на 50 человек", "Аналоговое коротковолновое радио", "Лабораторные записи",
        "Постер «Я, робот»", "Мел и грифельная доска", "Полнолицевая противогазовая маска", "Костюм биологической защиты",
        "Медицинский сканер", "Герметичные пакеты с едой", "Дезинфицирующий спрей", "Цифровой термометр", "Противовирусные таблетки",
        "Неизвестный артефакт, который вибрирует (отссылка на реплику Кайо)", "Беспроводной роутер без доступа к интернету", "Набор для анализа крови", "Диктофон", "Шприцы",
        "Коллекция кроссовок", "Большой запас батареек разных типов", "Пакеты для утилизации биологически опасных отходов", "Детектор радиации",
        "Схемы нервной системы", "Руководство по эксплуатации бункера",  "Теплостойкая одежда",
        "Настенные часы", "Ёмкости для воды", "Датчик температуры под землёй", "Ручной вентилятор",
        "Промышленный холодильник", "Полная карта подземных тоннелей города", "Измеритель Ультрафиолетового индекса", "Очки с глубокой защитой от солнца", "Аварийные пищевые пайки",
        "Любительское радио", "Радиационно-защитная палатка", "Очки ночного видения", "Солнцезащитный крем SPF 200", "Коллекция из 50 ножей, но без скинов :(",
    };

    private static readonly string[] AdditionalInformations =
    {
        "Свободно говорит на трёх языках", "Всегда умирает из-за подбирания скинов", "Оценивает людей по их инвентарю", 
        "Обсолютная регенирация частей тела, кроме половых органов", "Начинает плакать когда слышит «You want to play? Let's play.» (ульта чембера) ", 
        "Продал почку ради скина Prime Vandal",
        "Мог определить более 50 съедобных диких растений", "Каждый час у игрока изчезает 1 мозговая извилина, но он может пускать лазеры из глаз",
        "Знает основы оказания первой помощи",
        "Теликинез, но игрок платит за него чужой кровью (1л за 1 колдовство)", "Ежедневно практиковал медитацию", "Работал сантехником ", "Разбирается в основах электротехники ", 
        "Работал в кибербезопасности ",
        "Может определить агента по одной реплике", "Был пожарным", 
        "Преподавал классы самообороны", "Считает, что оператор - самое переоценённое оружие в игре", "Может объяснить, почему тиммейт проиграл дуэль, даже не видя её",
        "Энтузиаст садоводства с коллекцией семян", "Имел сертификат по первой помощи в условиях дикой природы",
        "Умеет ремонтировать бытовые вещи с помощью подручных средств", "Помнит расположение основных больниц и аптек нашего города",
        "Знает съедобные дикие растения наизусть", "Имеет подготовку по первой помощи с предыдущей работы медсестрой", 
        "Может разжечь огонь с помощью только кремня и сухих листьев", "Умеет ориентироваться по звёздам", 
        "Утверждает, что общается с воронами", "Может объяснить экономику раундов и правильные закупки команды",
        "Не может перестать напевать кринжевые песни из тиктока (я тебя могну)",
        "Называет всех находящихся рядом милой формой их имени", "Раньше был искусным взломщиком замков в известной банде",
        "Неконтролируемо смеётся над плохими шутками, даже если они не смешные", "Убил старушку топором",
        "Однажды застрял в шкафу на три часа во время учебной тревоги", "Эксперт по поиску редких медицинских припасов",
        "Имеет татуировку, отмечающую время, проведённое в тюрьме", "Держит тайный запас контрабанды сигарет в бункере",
        "Имеет репутацию человека, который решает споры кулаками, а не словами", "Искусен в скрытности и бесшумном дефузе спайка", 
        "Однажды избежал смерти, замаскировавшись под уборщика", "Встречался с 13 людьми одновременно", 
        "Случайно спровоцировал смертельную драку из-за запасов еды", "Часто вспоминает о своем убийстве человека (в целях самообороны)", 
        "Однажды с помощью пилки для ногтей защищался на концерте от охраны ", "Имеет сложную любовную жизнь даже в бункере", 
        "Держит нож с потёртой рукояткой от прошлой жестокой стычки", "Имеет три высших образования",
        "Известен умением очаровывать других, чтобы получить услуги или информацию", "Может очищать воду природными методами", 
        "Использует флирт как тактику выживания в напряжённых ситуациях", "Разбирается в ремонте механического оборудования",
        "Умеет определять местоположение противника по звукам шагов", "Обучен техникам выживания в дикой природе",
        "Знает, как делать натуральный отпугиватель насекомых", "Может создавать эффективные ловушки для животных или злоумышленников", 
        "Может назвать все основные виды оружия в VALORANT",
        "Знает способности всех агентов VALORANT", 
        "Опытный повар, который может готовить еду из ограниченных ресурсов"
    };

    private static readonly string[] BodyTypes =
    {
        "Спортивный", "Стройный", "Подтянутый", "Гибкий", "Среднего телосложения", "С избыточным весом", "Ожирение", "Бодибилдер"

    };
    
    private static readonly string[] FemaleReproductiveStatuses =
{
    "Беременна",
    "Не беременна",
    "Бесплодна",
    "Репродуктивно здорова"
};

private static readonly string[] MaleReproductiveStatuses =
{
    "Фертилен",
    "Бесплоден",
    "Импотент"
};

private static readonly string[] OtherReproductiveStatuses =
{
    "Репродуктивный статус не указан",
    "Бесплоден/бесплодна"
};

private string CreateReproductiveStatus(string gender)
{
    return gender switch
    {
        "Женский" => FemaleReproductiveStatuses[_random.Next(FemaleReproductiveStatuses.Length)],
        "Мужской" => MaleReproductiveStatuses[_random.Next(MaleReproductiveStatuses.Length)],
        _ => OtherReproductiveStatuses[_random.Next(OtherReproductiveStatuses.Length)]
    };
}
    private readonly Random _random = new();
    

    public Player CreateRandomPlayer()
    {
        var gender = Genders[_random.Next(Genders.Length)];
        return new Player
        {
            Profession = Professions[_random.Next(Professions.Length)],
            Age = _random.Next(18,111),
            Gender = gender,
            ReproductiveStatus = CreateReproductiveStatus(gender), 
            Orientation = Orientations[_random.Next(Orientations.Length)],
            Health = Healthes[_random.Next(Healthes.Length)],
            Hobby = Hobbys[_random.Next(Hobbys.Length)],
            BodyType = BodyTypes[_random.Next(BodyTypes.Length)],
            Phobia = Phobias[_random.Next(Phobias.Length)],
            Luggage = Luggaages[_random.Next(Luggaages.Length)],
            AdditionalInformation = AdditionalInformations[_random.Next(AdditionalInformations.Length)] 
            
            
        };
    }
}